Yes, this is an issue. It does prompt project replacement
```
  # google_project.main is tainted, so must be **replaced**
-/+ resource "google_project" "main" {
        auto_create_network = false
        billing_account     = "111111-222222-333333"
      + folder_id           = (known after apply)
      ~ id                  = "projects/my-new-project" -> (known after apply)
      - labels              = {} -> null
        name                = "my-new-project"
      ~ number              = "22915xxxxxxx" -> (known after apply)
        org_id              = "999999999999"
        project_id          = "my-new-project"
      + skip_delete         = (known after apply)
    }
``` 